Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.5.87/saml21b/edc/ATSAML21E15B.PIC
      <edc:SFRDef edc:_addr="0x4100600C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BASE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006010" edc:offset="0xEF0"/>
      <edc:SFRDef edc:_addr="0x41006F00" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ITCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006F04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x41006FA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006FA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41006FB0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKACCESS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FB4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVARCH" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41006FC0" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41006FC8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID4" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41006FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41007000" edc:offset="0xFFA400"/>
      <edc:SFRDef edc:_addr="0x42001400" edc:access="----nnnnn-------nnnnnnnn-nn---nn" edc:cname="CTRLA" edc:impl="0xF80FF63" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RESOLUTION" edc:desc="Enhanced Resolution" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Dithering is disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DITH4" edc:desc="Dithering is done every 16 PWM frames" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DITH5" edc:desc="Dithering is done every 32 PWM frames" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DITH6" edc:desc="Dithering is done every 64 PWM frames" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No division" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide by 256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide by 1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset counter on next GCLK" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset counter on next GCLK and reset prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:desc="Auto Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSYNC" edc:desc="Master Synchronization (only for TCC Slave Instance)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMAOS" edc:desc="DMA One-shot Trigger Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN0" edc:desc="Capture Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN1" edc:desc="Capture Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN2" edc:desc="Capture Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN3" edc:desc="Capture Channel 3 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001404" edc:access="nnnnnnnn" edc:cname="CTRLBCLR" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:desc="Ramp Index Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="TCC Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
